In [1]:
import pandas as pd

In [2]:
pwd

'D:\\Works\\Learn\\tensorflow\\tensorflow-udemy\\00-Crash-Course-Basics'

In [2]:
df = pd.read_csv('salaries.csv')

In [3]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [4]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [7]:
df[['Salary','Name']]

   Salary    Name
0   50000    John
1  120000   Sally
2   80000  Alyssa

In [8]:
df['Salary'] > 60000

0    False
1     True
2     True
Name: Salary, dtype: bool

In [9]:
myfilter = df['Salary'] > 60000
df[myfilter]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27